package indiv.park.starter.loader;

public class LogoLoader {
	
	private LogoLoader() {}
	
	public static void showLogo() {
		System.out.println();
		System.out.println("┬┌┐┌┌┬┐┬┬  ┬   ┌─┐┌─┐┬─┐┬┌─   ┌┬┐┌─┐┌┬┐┬ ┬┬  ┌─┐");
		System.out.println("││││ │││└┐┌┘───├─┘├─┤├┬┘├┴┐───││││ │ │││ ││  ├┤ ");
		System.out.println("┴┘└┘─┴┘┴ └┘    ┴  ┴ ┴┴└─┴ ┴   ┴ ┴└─┘─┴┘└─┘┴─┘└─┘");
		System.out.println("::indiv-park-module::");
		System.out.println();
	}
	
	public static void showStart() {
		System.out.println();
		System.out.println("┌─┐┌─┐┌─┐┬  ┬┌─┐┌─┐┌┬┐┬┌─┐┌┐┌  ┌─┐┌┬┐┌─┐┬─┐┌┬┐");
		System.out.println("├─┤├─┘├─┘│  ││  ├─┤ │ ││ ││││  └─┐ │ ├─┤├┬┘ │ ");
		System.out.println("┴ ┴┴  ┴  ┴─┘┴└─┘┴ ┴ ┴ ┴└─┘┘└┘  └─┘ ┴ ┴ ┴┴└─ ┴ ");
		System.out.println();

	}
}
